/* Clear, verb, short name for a button. Clears all the messages in a conversation. */
"CLEAR_BTN" = "Clear";

/* Title for the Blanket main page */
"HOMEPAGE_TITLE" = "Blanket";

/* Title for the conversation create error dialog */
"COULD_NOT_CREATE_CONVERSATION_TITLE" = "Create Conversation Failed";

/* Message for when a scanned conversation ID does not match the ID generated in step 1 */
"CONVERSATION_ID_MISMATCH_MESSAGE" = "Conversation ID does not match.";

/* Message for when a scanned conversation ID does not match the ID generated in step 1 */
"INVALID_CODE_MESSAGE" = "Not a valid Blanket code.";

/* Title for the conversation delete error dialog */
"COULD_NOT_DELETE_CONVERSATION_TITLE" = "Delete Conversation Failed";

/* Descriptive text for the code create error dialog */
"COULD_NOT_GENERATE_CODE_TEXT" = "Unable to generate a code. Perhaps your name (in Settings) is too long?";

/* Title for the code create error dialog */
"COULD_NOT_GENERATE_CODE_TITLE" = "Code Generation Failed";

/* Title for the refresh error dialog */
"COULD_NOT_REFRESH_TITLE" = "Conversation Refresh Failed";

/* Title for the send error dialog */
"COULD_NOT_SEND_TITLE" = "Message Send Failed";

/* String of arbitrary length for an error message. */
"ENCRYPTION_FAILED_MESSAGE_NOT_SENT" = "Encryption failed; your message has not been sent.";

/* The phrase 'Start by generating a code' */
"NEW_CONVERSATION_GENERATE_CODE_STEP" = "Start by generating a code";

/* The phrase 'You must be in the same physical location as your conversation partner in order to start a conversation with Blanket. One of you should start by generating a code, and the other should start by scanning that code.' */
"NEW_CONVERSATION_PROMPT_FOOTER" = "You must be in the same physical location as your conversation partner to start a conversation with Blanket. One of you should start by generating a code, and the other should start by scanning that code.";

/* The phrase 'How do you want to start this conversation?' */
"NEW_CONVERSATION_PROMPT_HEADER" = "How do you want to start this conversation?";

/* The phrase 'Start by scanning a code' */
"NEW_CONVERSATION_SCAN_CODE_STEP" = "Start by scanning a code";

/* Short, button title for 'Create new conversation' */
"NEW_CONVO_BTN" = "New Conversation";

/* Short title for a button */
"OK_BTN" = "OK";

/* Send, verb, short title for a button */
"SEND_BTN" = "Send";

/* Short, button title for settings */
"SETTINGS_BTN" = "Settings";

/* Instructions for getting to the next step from showing code to a partner.  */
"NEXT_STEP_BTN" = "Touch this button when your partner has scanned the code";

/* Title for an alert asking for the user's name. */
"ENTER_YOUR_NAME_TITLE" = "What's Your Name?";

/* Message for an alert asking for the user's name. Explain that other people will see this name in their app, and that it is only stored locally (never transmitted to the server). */
"ENTER_YOUR_NAME_MESSAGE" = "You can change this later; others will see this name in their chat list.";

/* Short label for the phrase 'Your Name'; appears next to a field asking for the user's name. */
"YOUR_NAME_LABEL" = "Your Name";

/* Short one- or two-liner for a HUD status, 'Cryptography Setup, Please Wait' */
"STATUS_INITIALIZING_CRYPTO" = "Cryptography Setup, Please Wait...";

/* Short one- or two-liner for a HUD status, 'Cryptography System Initialized' */
"STATUS_INITIALIZED_CRYPTO" = "Cryptography System Initialized!";

/* Short one-liner for a HUD status, 'Sending Message' */
"STATUS_SENDING_MESSAGE" = "Sending message...";

/* One-liner for HUD status, 'Creating converastion' */
"STATUS_CREATING_CONVERSATION" = "Creating converastion...";

/* The phrase 'Updated [just now|3 hours ago|2 days ago]', no trailing punctuation. Time interval is automatically localized. */
"LAST_UPDATE_STRING_FORMAT" = "Updated %@";

/* The phrase 'Last message [just now|3 hours ago|2 days ago]', no trailing punctuation. Time interval is automatically localized. */
"LAST_MESSAGE_STRING_FORMAT" = "Last message %@";

/* The phrase 'Conversation needs refresh'; displayed below a person's name when the conversation is stale. */
"CONVERSATION_NEEDS_REFRESH_FORMAT" = "Needs refresh; updated %@";

/* Touch this message to decrypt it. */
"MESSAGE_TAP_TO_DECRYPT" = "Encrypted; tap to decrypt.";

/*** This section contains localization keys returned by the server. ***/
"NO_AUTHENTICATION" = "The client failed to provide authentication credentials.";
"NOT_FOUND" = "Resource not found.";
"UNAUTHORIZED" = "You are not authorized to perform this action.";
"CHANNEL_CLOSED" = "This channel is closed.";
"CHANNEL_NOT_FOUND" = "Channel not found.";
"UNSUPPORTED_METHOD" = "Method not supported";
"INTERNAL_SERVER_ERROR" = "The server experienced an error. Please try again later.";

